app/Services/PeriodContextService.php

select "id" from "periode" where "is_active" = 1 and "periode"."deleted_at" is null order by "periode" desc limit 1
---
    public function getDefaultPeriodId(): ?int
    {
        return Cache::remember('default_periode_id', 3600, function () {
            return Periode::where('is_active', true)
                ->orderBy('periode', 'desc')
                ->value('id');