app/Http/Controllers/HomeController.php

select count(*) as aggregate from "lokasi" where "lokasi"."deleted_at" is null
select count(*) as aggregate from "kelompok_kkn" where "kelompok_kkn"."deleted_at" is null
select count(*) as aggregate from "peserta_kkn" where "status" in ('approved', 'completed') and "peserta_kkn"."deleted_at" is null
select count(*) as aggregate from "tahun_akademik"
---
    public function index()
    {
        try {
            $stats = [
                'students' => PesertaKkn::whereIn('status', ['approved', 'completed'])->count(),
                'groups' => KelompokKkn::count(),
                'locations' => Lokasi::count(),
                'academic_years' => TahunAkademik::count() ?: 1,
            ];