apps/api/app/Providers/AiConfigServiceProvider.php

select * from "system_settings" where "group" = 'ai_settings' or "config_key"::text like '%_api_key' or "config_key"::text like '%_api_%'
---
    private function fetchProviderConfigFromDatabase(): array
    {
        $config = [];

        // Get all AI-related settings from database
        $settings = SystemSetting::where('group', 'ai_settings')
            ->orWhere('config_key', 'like', '%_api_key')
            ->orWhere('config_key', 'like', '%_api_%')
            ->get();