apps/api/app/Services/PeriodContextService.php

    public function getDefaultPeriodId(): ?int
    {
        $periodId = Cache::remember('default_periode_id', 3600, function () {
            $value = Periode::where('is_active', true)
                ->orderBy('periode', 'desc')
                ->value('id');

            return is_numeric($value) ? (int) $value : null;
        });
---
select "id" from "periode" where "is_active" = 1 and "periode"."deleted_at" is null order by "periode" desc limit 1

    public function getAvailablePeriods(): array
    {
        return Cache::remember('available_periods', 3600, function () {
            return Periode::with(['tahunAkademik', 'jenisKkn'])
                ->orderBy('periode', 'desc')
                ->orderBy('jenis')
                ->get()
                ->groupBy('periode')
                ->map(function ($periods) {
                    return $periods->map(fn ($period) => $this->serializePeriod($period));
                })
                ->toArray();
        });
---
select * from "periode" where "periode"."deleted_at" is null order by "periode" desc, "jenis" asc