apps/api/app/Models/KKN/SystemSetting.php

    public static function get(string $key, $default = null)
    {
        try {
            return Cache::remember("system_setting_{$key}", now()->addHours(24), function () use ($key, $default) {
                if (! Schema::hasTable('system_settings')) {
                    return $default;
                }
                $setting = self::where('config_key', $key)->first();
                if (! $setting) {
                    return $default;
                }
                $value = $setting->value;
                // Decrypt secret values
                if (in_array($key, self::SECRET_KEYS) && $value) {
                    try {
                        $value = Crypt::decryptString($value);
                    } catch (DecryptException $e) {
                        // Value stored before encryption was added; return as-is
                    }
                }

                return $value;
            });
---
select * from "system_settings" where "config_key" = 'master_api_url' limit 1